tutorials/lagrangian/reactingParcelFoam/recycleParticles/constant/g
/*--------------------------------*- C++ -*---------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  1906				                     |
|   \  /    A nd           | Web:      http://www.OpenFOAM.com				 |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/


FoamFile
{
    version         1906;
    format          ascii;
    class           uniformDimensionedVectorField;
    object          g;
    location        "constant";
}

dimensions      [0 1 -2 0 0 0 0];

//value           (0 0 -9.81);
value           (0 0 0);

