tutorials/lagrangian/reactingParcelFoam/recycleParticles/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kEpsilon;
    printCoeffs     no;
    turbulence      on;
}

// ************************************************************************* //



/*
simulationType  RAS;

RAS
{
    RASModel            kEpsilon;

    turbulence          on;

    printCoeffs         on;
}
*/


// ************************************************************************* //
