tutorials/lagrangian/reactingParcelFoam/recycleParticles/system/decomposeParDict
/*--------------------------------*- C++ -*---------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2006                                 |
|   \  /    A nd           | Web:      http://www.OpenFOAM.com				 |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          decomposeParDict;
    location        "system";
}

numberOfSubdomains 2;

method          scotch;

simpleCoeffs
{
    n               ( 1 2 1 );
    delta           0.001;
}

hierarchicalCoeffs
{
    n               ( 1 2 1 );
    delta           0.001;
    order           xyz;
}

scotchCoeffs
{
}

manualCoeffs
{
    dataFile        ("" );
}

distributed     no;

roots           ();

